# Pandas
- library for Data Analysis and Manipulation


## Why Pandas?
- provides ability to work with Tabular data.
- **Tabular Data** - data that is organized into tables having rows and cols

In [1]:
%config Completer.use_jedi=False

In [2]:
import pandas as pd

## Series
- Series is a one dimensional labelled array that can hold/store data

In [3]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [4]:
book_title = pd.Series(book_title)
book_title

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [5]:
type(book_title)

pandas.core.series.Series

In [6]:
book_title[2]

'Python'

In [7]:
book_title.index = ['a', 'b', 'c', 'd']

In [8]:
book_title

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

In [9]:
book_title['c']

'Python'

## DataFrame - Introduction
- 2D labelled array having index and columns. 
- multiple series combined together to form a Dataframe.
- most widely used data structure in pandas

In [10]:
import numpy as np

In [11]:
arr = np.random.randint(10, 100, size =(6, 4))
arr

array([[76, 42, 29, 19],
       [16, 96, 43, 82],
       [35, 67, 74, 85],
       [74, 48, 86, 63],
       [18, 50, 43, 46],
       [37, 55, 40, 76]])

In [12]:
df = pd.DataFrame(data=arr)
df

    0   1   2   3
0  76  42  29  19
1  16  96  43  82
2  35  67  74  85
3  74  48  86  63
4  18  50  43  46
5  37  55  40  76

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df[2]

0    29
1    43
2    74
3    86
4    43
5    40
Name: 2, dtype: int32

In [15]:
# second element of the second column
df[2][2]

74

In [16]:
type(df[2])

pandas.core.series.Series

In [17]:
type(df[0])

pandas.core.series.Series

In [18]:
df.columns =  ['A', 'B','C','D']
df

    A   B   C   D
0  76  42  29  19
1  16  96  43  82
2  35  67  74  85
3  74  48  86  63
4  18  50  43  46
5  37  55  40  76

In [19]:
df['D']

0    19
1    82
2    85
3    63
4    46
5    76
Name: D, dtype: int32

In [20]:
df.shape

(6, 4)

In [21]:
df.head(n=3)

    A   B   C   D
0  76  42  29  19
1  16  96  43  82
2  35  67  74  85

In [22]:
df.tail(n=2)

    A   B   C   D
4  18  50  43  46
5  37  55  40  76

In [23]:
# Extracting Columns
df['C']

0    29
1    43
2    74
3    86
4    43
5    40
Name: C, dtype: int32

In [24]:
# cols = ['A', 'B']
# df[cols]

df[['A', 'B']]

    A   B
0  76  42
1  16  96
2  35  67
3  74  48
4  18  50
5  37  55

In [25]:
df[['B', 'D', 'A']]

    B   D   A
0  42  19  76
1  96  82  16
2  67  85  35
3  48  63  74
4  50  46  18
5  55  76  37

In [26]:
df

    A   B   C   D
0  76  42  29  19
1  16  96  43  82
2  35  67  74  85
3  74  48  86  63
4  18  50  43  46
5  37  55  40  76

In [27]:
# Add New Columns

In [27]:
df['A+B'] = df['A'] + df['B']

In [28]:
df

    A   B   C   D  A+B
0  76  42  29  19  118
1  16  96  43  82  112
2  35  67  74  85  102
3  74  48  86  63  122
4  18  50  43  46   68
5  37  55  40  76   92

In [29]:
df['A-B'] = df['A'] * df['B']

In [30]:
df

    A   B   C   D  A+B   A-B
0  76  42  29  19  118  3192
1  16  96  43  82  112  1536
2  35  67  74  85  102  2345
3  74  48  86  63  122  3552
4  18  50  43  46   68   900
5  37  55  40  76   92  2035

In [31]:
# df=df.drop(columns=['A-B'])
df.drop(columns=['A-B'], inplace=True)

In [32]:
df

    A   B   C   D  A+B
0  76  42  29  19  118
1  16  96  43  82  112
2  35  67  74  85  102
3  74  48  86  63  122
4  18  50  43  46   68
5  37  55  40  76   92

### Indexing/Extracting Data

In [33]:
df.index = "p q r s t u".split()
print(type(df.index))

<class 'pandas.core.indexes.base.Index'>

In [34]:
df

    A   B   C   D  A+B
p  76  42  29  19  118
q  16  96  43  82  112
r  35  67  74  85  102
s  74  48  86  63  122
t  18  50  43  46   68
u  37  55  40  76   92

In [35]:
# loc - location
df.loc['p']

A       76
B       42
C       29
D       19
A+B    118
Name: p, dtype: int32

In [36]:
print(type(df.loc['p']))

<class 'pandas.core.series.Series'>

In [37]:
df.loc['t']

A      18
B      50
C      43
D      46
A+B    68
Name: t, dtype: int32

In [38]:
# iloc - integer location of the row
df.iloc[4]

A      18
B      50
C      43
D      46
A+B    68
Name: t, dtype: int32

In [39]:
df.iloc[0]

A       76
B       42
C       29
D       19
A+B    118
Name: p, dtype: int32

In [40]:
df

    A   B   C   D  A+B
p  76  42  29  19  118
q  16  96  43  82  112
r  35  67  74  85  102
s  74  48  86  63  122
t  18  50  43  46   68
u  37  55  40  76   92

In [41]:
df.iloc[2:5]

    A   B   C   D  A+B
r  35  67  74  85  102
s  74  48  86  63  122
t  18  50  43  46   68

In [43]:
df.iloc[2:5][['A', 'B']]

    A   B
r  35  67
s  74  48
t  18  50

In [44]:
df.iloc[-2:][['D', 'A+B']]

    D  A+B
t  46   68
u  76   92

In [45]:
df.iloc[-2:, -2: ]

    D  A+B
t  46   68
u  76   92

### Masking - Boolean Indexing

In [46]:
df

    A   B   C   D  A+B
p  76  42  29  19  118
q  16  96  43  82  112
r  35  67  74  85  102
s  74  48  86  63  122
t  18  50  43  46   68
u  37  55  40  76   92

In [47]:
# masking
mask = df > 30
mask

       A     B      C      D   A+B
p   True  True  False  False  True
q  False  True   True   True  True
r   True  True   True   True  True
s   True  True   True   True  True
t  False  True   True   True  True
u   True  True   True   True  True

In [48]:
df[mask]

      A   B     C     D  A+B
p  76.0  42   NaN   NaN  118
q   NaN  96  43.0  82.0  112
r  35.0  67  74.0  85.0  102
s  74.0  48  86.0  63.0  122
t   NaN  50  43.0  46.0   68
u  37.0  55  40.0  76.0   92

In [49]:
df[ df > 30 ]

      A   B     C     D  A+B
p  76.0  42   NaN   NaN  118
q   NaN  96  43.0  82.0  112
r  35.0  67  74.0  85.0  102
s  74.0  48  86.0  63.0  122
t   NaN  50  43.0  46.0   68
u  37.0  55  40.0  76.0   92

In [50]:
#This mask is  used to extraxt all the rows whose "B" column is greater than 40
mask = df['B'] > 40
mask

p    True
q    True
r    True
s    True
t    True
u    True
Name: B, dtype: bool

In [51]:
df[mask]

    A   B   C   D  A+B
p  76  42  29  19  118
q  16  96  43  82  112
r  35  67  74  85  102
s  74  48  86  63  122
t  18  50  43  46   68
u  37  55  40  76   92

In [53]:
# extracting values from Col C and col D where B column has value >40
df[df['B'] > 40 ][['C', 'D']]

    C   D
p  29  19
q  43  82
r  74  85
s  86  63
t  43  46
u  40  76

In [54]:
df['A']>40

p     True
q    False
r    False
s     True
t    False
u    False
Name: A, dtype: bool

In [55]:
df['D'] < 50

p     True
q    False
r    False
s    False
t     True
u    False
Name: D, dtype: bool

In [56]:
(df['A']> 40) & (df['D']<50)

p     True
q    False
r    False
s    False
t    False
u    False
dtype: bool

In [57]:
df[(df['A']> 40) & (df['D']<50)]

    A   B   C   D  A+B
p  76  42  29  19  118

In [58]:
df

    A   B   C   D  A+B
p  76  42  29  19  118
q  16  96  43  82  112
r  35  67  74  85  102
s  74  48  86  63  122
t  18  50  43  46   68
u  37  55  40  76   92

In [59]:
#converting a dataframe to a numpy array
df_array = df.values
df_array

array([[ 76,  42,  29,  19, 118],
       [ 16,  96,  43,  82, 112],
       [ 35,  67,  74,  85, 102],
       [ 74,  48,  86,  63, 122],
       [ 18,  50,  43,  46,  68],
       [ 37,  55,  40,  76,  92]])

In [60]:
type(df_array)

numpy.ndarray

## Iris Dataset -  Introduction

In [61]:
!dir

 Volume in drive C is Windows-SSD
 Volume Serial Number is A614-ED7A

 Directory of C:\Users\SWRAJ KANT SHARMA\Desktop\machine-learning-online-2018-master\1. Python Programming\python-data-science-mastercourse\05 Pandas

31-08-2021  10:19    <DIR>          .
31-08-2021  10:19    <DIR>          ..
18-06-2021  22:22             6,148 .DS_Store
18-06-2021  22:22    <DIR>          .ipynb_checkpoints
24-08-2021  11:10    <DIR>          Assignment
18-06-2021  22:22             4,009 iris.csv
24-08-2021  10:14             4,254 modified_iris.csv
18-06-2021  22:22             9,891 new_iris.xlsx
31-08-2021  10:19           186,244 pandas.ipynb
               5 File(s)        210,546 bytes
               4 Dir(s)  151,316,926,464 bytes free

In [62]:
iris = pd.read_csv("./iris.csv")

In [63]:
type(iris)

pandas.core.frame.DataFrame

In [61]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [62]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [63]:
#  total of 150 data points, 
#  columns are 5
iris.shape

(150, 5)

In [64]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [65]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [66]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [67]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [67]:
# No. of unique species of flowers
iris['species'].nunique()

3

In [68]:
# Name of all Unique Species
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [69]:
#  How many setosa flowers are there?
iris [ iris['species'] == 'versicolor' ]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor
55           5.7          2.8           4.5          1.3  versicolor
56           6.3          3.3           4.7          1.6  versicolor
57           4.9          2.4           3.3          1.0  versicolor
58           6.6          2.9           4.6          1.3  versicolor
59           5.2          2.7           3.9          1.4  versicolor
60           5.0          2.0           3.5          1.0  versicolor
61           5.9          3.0           4.2          1.5  versicolor
62           6.0          2.2           4.0          1.0  versicolor
63           6.1          2.9           4.7          1.4  versicolor
64           5.6          2.9           3.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
66           5.6          3.0           4.5          1.5  versicolor
67           5.8          2.7           4.1          1.0  versicolor
68           6.2          2.2           4.5          1.5  versicolor
69           5.6          2.5           3.9          1.1  versicolor
70           5.9          3.2           4.8          1.8  versicolor
71           6.1          2.8           4.0          1.3  versicolor
72           6.3          2.5           4.9          1.5  versicolor
73           6.1          2.8           4.7          1.2  versicolor
74           6.4          2.9           4.3          1.3  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
78           6.0          2.9           4.5          1.5  versicolor
79           5.7          2.6           3.5          1.0  versicolor
80           5.5          2.4           3.8          1.1  versicolor
81           5.5          2.4           3.7          1.0  versicolor
82           5.8          2.7           3.9          1.2  versicolor
83           6.0          2.7           5.1          1.6  versicolor
84           5.4          3.0           4.5          1.5  versicolor
85           6.0          3.4           4.5          1.6  versicolor
86           6.7          3.1           4.7          1.5  versicolor
87           6.3          2.3           4.4          1.3  versicolor
88           5.6          3.0           4.1          1.3  versicolor
89           5.5          2.5           4.0          1.3  versicolor
90           5.5          2.6           4.4          1.2  versicolor
91           6.1          3.0           4.6          1.4  versicolor
92           5.8          2.6           4.0          1.2  versicolor
93           5.0          2.3           3.3          1.0  versicolor
94           5.6          2.7           4.2          1.3  versicolor
95           5.7          3.0           4.2          1.2  versicolor
96           5.7          2.9           4.2          1.3  versicolor
97           6.2          2.9           4.3          1.3  versicolor
98           5.1          2.5           3.0          1.1  versicolor
99           5.7          2.8           4.1          1.3  versicolor

In [73]:
iris[iris['species']=='versicolor'].shape

(50, 5)

In [74]:
#value_count()
iris['species'].value_counts()

setosa        50
virginica     50
versicolor    50
Name: species, dtype: int64

In [71]:
iris['species'].value_counts()['virginica']

50

In [75]:
iris['sepal_length'].mean()

5.843333333333334

In [76]:
iris['petal_width'].max()

2.5

In [77]:
iris['petal_width'].min()

0.1

In [78]:
iris['petal_width'].sum()

179.8

In [79]:
iris['petal_width']

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [80]:
# if the sepal length is same then sort by using sepal width
iris.sort_values(by=["sepal_length", "sepal_width"])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [78]:
# applying a function len on species   
iris['species'].apply(len)  # finds the length of  each species

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [79]:
len('setosa')

6

In [80]:
len('virginica')

9

In [81]:
iris.apply(lambda x: x + x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

### Grouping Data Together

In [82]:
# min value of each column
iris.aggregate('min')

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [83]:
#list of aggregate function
iris.aggregate(['min', 'max', 'mean', 'median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min         4.300000        2.000      1.000000     0.100000     setosa
max         7.900000        4.400      6.900000     2.500000  virginica
mean        5.843333        3.054      3.758667     1.198667        NaN
median      5.800000        3.000      4.350000     1.300000        NaN

In [82]:
# we can apply aggregation function on groupby
groupby = iris.groupby('species')
groupby

In [83]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [84]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [85]:
iris[ iris['species'] == 'setosa' ]['sepal_length'].mean()

5.006

In [86]:
groupby.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [87]:
groupby.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        170.9          73.2         12.2
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [90]:
groupby.describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.464000    4.260000   5.552000
             std     0.173511    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

### Handling Missing Data
- dropna()
- fillna()

In [88]:
iris = pd.read_csv('./iris.csv')

In [89]:
import warnings
warnings.filterwarnings('ignore')

In [90]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [91]:
nan_idx = np.random.randint(0, 150, 20)
iris['sepal_length'][nan_idx] = np.nan

In [93]:
nan_idx

array([ 78,  56,  14,  68,  22,   2,  81,  91, 100,  36,  11,  83,  98,
        17,  28, 121,  82,  68, 101, 119])

In [92]:
iris['sepal_length']

0      5.1
1      4.9
2      NaN
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [94]:
nan_idx = np.random.randint(0, 150, 15)
iris['petal_width'][nan_idx] = np.nan

In [95]:
iris['petal_width']

0      0.2
1      0.2
2      0.2
3      NaN
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [96]:
#count of NaN values in each column
iris.isna().sum()

sepal_length    19
sepal_width      0
petal_length     0
petal_width     14
species          0
dtype: int64

In [99]:
# All the rows which contains NaN value will be removed.
#  This is not a preferrable prectice
# iris.dropna()

In [100]:
iris['sepal_length'].fillna(value = "FILLTHIS")[:50]

0          5.1
1          4.9
2          4.7
3          4.6
4            5
5          5.4
6          4.6
7            5
8     FILLTHIS
9          4.9
10         5.4
11         4.8
12         4.8
13    FILLTHIS
14         5.8
15         5.7
16         5.4
17         5.1
18         5.7
19         5.1
20         5.4
21    FILLTHIS
22         4.6
23         5.1
24         4.8
25           5
26           5
27         5.2
28         5.2
29         4.7
30         4.8
31         5.4
32    FILLTHIS
33         5.5
34    FILLTHIS
35           5
36         5.5
37         4.9
38         4.4
39    FILLTHIS
40           5
41         4.5
42         4.4
43           5
44         5.1
45         4.8
46         5.1
47         4.6
48         5.3
49           5
Name: sepal_length, dtype: object

In [101]:
iris['sepal_length'] =  iris['sepal_length'].fillna(value = round(iris['sepal_length'].mean(), 1) )

In [102]:
iris['sepal_length'][:50]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     5.9
9     4.9
10    5.4
11    4.8
12    4.8
13    5.9
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.9
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.9
33    5.5
34    5.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.9
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [103]:
iris['petal_length'][:50]

0     1.4
1     1.4
2     1.3
3     1.5
4     1.4
5     1.7
6     1.4
7     1.5
8     1.4
9     1.5
10    1.5
11    1.6
12    1.4
13    1.1
14    1.2
15    1.5
16    1.3
17    1.4
18    1.7
19    1.5
20    1.7
21    1.5
22    1.0
23    1.7
24    1.9
25    1.6
26    1.6
27    1.5
28    1.4
29    1.6
30    1.6
31    1.5
32    1.5
33    1.4
34    1.5
35    1.2
36    1.3
37    1.5
38    1.3
39    1.5
40    1.3
41    1.3
42    1.3
43    1.6
44    1.9
45    1.4
46    1.6
47    1.4
48    1.5
49    1.4
Name: petal_length, dtype: float64

In [104]:
iris.isna().sum()

sepal_length     0
sepal_width      0
petal_length     0
petal_width     15
species          0
dtype: int64

### Concat/Merge Dataframes

In [105]:
new_df = pd.DataFrame( np.random.randint(0, 7, size=(10, 4)))

In [106]:
new_df

   0  1  2  3
0  1  5  6  4
1  4  0  2  6
2  5  1  4  2
3  2  4  0  4
4  4  2  6  0
5  3  4  1  2
6  1  6  2  2
7  6  4  6  1
8  6  5  3  6
9  1  5  1  1

In [107]:
new_df['species'] = "new-species"

In [108]:
new_df.head()

   0  1  2  3      species
0  1  5  6  4  new-species
1  4  0  2  6  new-species
2  5  1  4  2  new-species
3  2  4  0  4  new-species
4  4  2  6  0  new-species

In [109]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [110]:
new_df.columns = iris.columns

In [111]:
new_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0             1            5             6            4  new-species
1             4            0             2            6  new-species
2             5            1             4            2  new-species
3             2            4             0            4  new-species
4             4            2             6            0  new-species

In [112]:
iris = pd.concat((iris, new_df), axis=0 )

In [113]:
iris.shape

(160, 5)

In [114]:
## Merging Dataframes

In [115]:
df1 = pd.DataFrame({'S_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 2 , 4, 5, 3]})

In [116]:
df1

    S_Name  CGPA
0    Mohit     2
1    Jatin     4
2  Prateek     5
3    Mohit     3

In [117]:
df2 = pd.DataFrame({'T_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 3 , 6, 8, 9]})

In [118]:
df2

    T_Name  CGPA
0    Mohit     3
1    Jatin     6
2  Prateek     8
3    Mohit     9

In [119]:
df1.merge(df2, how = 'inner')

  S_Name  CGPA T_Name
0  Mohit     3  Mohit

In [120]:
df1.merge(df2, how = 'left')

    S_Name  CGPA T_Name
0    Mohit     2    NaN
1    Jatin     4    NaN
2  Prateek     5    NaN
3    Mohit     3  Mohit

In [121]:
df1.merge(df2, how= 'right')

  S_Name  CGPA   T_Name
0  Mohit     3    Mohit
1    NaN     6    Jatin
2    NaN     8  Prateek
3    NaN     9    Mohit

In [122]:
df1.merge(df2, how= 'outer')

    S_Name  CGPA   T_Name
0    Mohit     2      NaN
1    Jatin     4      NaN
2  Prateek     5      NaN
3    Mohit     3    Mohit
4      NaN     6    Jatin
5      NaN     8  Prateek
6      NaN     9    Mohit

### Output Files

In [123]:
iris

    sepal_length  sepal_width  petal_length  petal_width      species
0            5.1          3.5           1.4          0.2       setosa
1            4.9          3.0           1.4          0.2       setosa
2            4.7          3.2           1.3          0.2       setosa
3            4.6          3.1           1.5          0.2       setosa
4            5.0          3.6           1.4          NaN       setosa
..           ...          ...           ...          ...          ...
5            3.0          4.0           1.0          2.0  new-species
6            1.0          6.0           2.0          2.0  new-species
7            6.0          4.0           6.0          1.0  new-species
8            6.0          5.0           3.0          6.0  new-species
9            1.0          5.0           1.0          1.0  new-species

[160 rows x 5 columns]

In [124]:
iris.isna().sum()

sepal_length     0
sepal_width      0
petal_length     0
petal_width     15
species          0
dtype: int64

In [125]:
iris.to_csv('./modified_iris.csv', index=False)

In [126]:
modified_iris = pd.read_csv('./modified_iris.csv')

In [127]:
modified_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          NaN  setosa

In [128]:
iris.to_excel("./new_iris.xlsx", sheet_name="iris sheet")
iris.to_excel()

ModuleNotFoundError: No module named 'openpyxl'